Revit 2027 API
AnalyticalModelSelector Constructor
 Creates a selector for the analytical model geometry.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalyticalModelSelector()
Public Sub New
public:
AnalyticalModelSelector()
new : unit -> AnalyticalModelSelector
Remarks
 This version is useful for single-curve or single-point analytical models. Additionally, this only acts with respect to the entire curve or point.
See Also
Reference
AnalyticalModelSelector Class
AnalyticalModelSelector Overload
Autodesk.Revit.DB.Structure Namespace